In [53]:
import pandas as pd
import sqlite3

In [54]:
connection = sqlite3.connect("data/chinook.db")
crsr = connection.cursor()

In [55]:
# Con esta función leemos los datos y lo pasamos a un DataFrame de Pandas
def sql_query(query):

    # Ejecuta la query
    crsr.execute(query)

    # Almacena los datos de la query 
    ans = crsr.fetchall()

    # Obtenemos los nombres de las columnas de la tabla
    names = [description[0] for description in crsr.description]

    return pd.DataFrame(ans,columns=names)

In [56]:
query = '''
SELECT c.FirstName,c.LastName,c.Country
FROM customers as c
WHERE c.Country  = "Brazil" 
'''

df = sql_query(query)
df

   FirstName   LastName Country
0       Luís  Gonçalves  Brazil
1    Eduardo    Martins  Brazil
2  Alexandre      Rocha  Brazil
3    Roberto    Almeida  Brazil
4   Fernanda      Ramos  Brazil

In [57]:
query = '''
SELECT e.FirstName,e.LastName,e.Title
FROM employees as e
WHERE e.Title  = "Sales Support Agent" 
'''

df = sql_query(query)
df

  FirstName LastName                Title
0      Jane  Peacock  Sales Support Agent
1  Margaret     Park  Sales Support Agent
2     Steve  Johnson  Sales Support Agent

In [58]:
query = '''
SELECT t.Name,t.Composer
FROM tracks as t
WHERE t.Composer  = "AC/DC" 
'''

df = sql_query(query)
df

                           Name Composer
0                       Go Down    AC/DC
1                   Dog Eat Dog    AC/DC
2             Let There Be Rock    AC/DC
3                Bad Boy Boogie    AC/DC
4                 Problem Child    AC/DC
5                      Overdose    AC/DC
6  Hell Ain't A Bad Place To Be    AC/DC
7             Whole Lotta Rosie    AC/DC

In [59]:
query = '''
SELECT c.FirstName,c.LastName,c.Country,c.CustomerId
FROM customers as c
WHERE c.Country  != "USA" 
'''

df = sql_query(query)
df

    FirstName      LastName         Country  CustomerId
0        Luís     Gonçalves          Brazil           1
1      Leonie        Köhler         Germany           2
2    François      Tremblay          Canada           3
3       Bjørn        Hansen          Norway           4
4   František   Wichterlová  Czech Republic           5
5      Helena          Holý  Czech Republic           6
6      Astrid        Gruber         Austria           7
7        Daan       Peeters         Belgium           8
8        Kara       Nielsen         Denmark           9
9     Eduardo       Martins          Brazil          10
10  Alexandre         Rocha          Brazil          11
11    Roberto       Almeida          Brazil          12
12   Fernanda         Ramos          Brazil          13
13       Mark       Philips          Canada          14
14   Jennifer      Peterson          Canada          15
15     Robert         Brown          Canada          29
16     Edward       Francis          Canada          30
17     Martha          Silk          Canada          31
18      Aaron      Mitchell          Canada          32
19      Ellie      Sullivan          Canada          33
20       João     Fernandes        Portugal          34
21   Madalena       Sampaio        Portugal          35
22     Hannah     Schneider         Germany          36
23       Fynn    Zimmermann         Germany          37
24     Niklas      Schröder         Germany          38
25    Camille       Bernard          France          39
26  Dominique      Lefebvre          France          40
27       Marc        Dubois          France          41
28      Wyatt        Girard          France          42
29   Isabelle       Mercier          France          43
30      Terhi    Hämäläinen         Finland          44
31   Ladislav        Kovács         Hungary          45
32       Hugh      O'Reilly         Ireland          46
33      Lucas       Mancini           Italy          47
34   Johannes  Van der Berg     Netherlands          48
35  Stanisław        Wójcik          Poland          49
36    Enrique         Muñoz           Spain          50
37     Joakim     Johansson          Sweden          51
38       Emma         Jones  United Kingdom          52
39       Phil        Hughes  United Kingdom          53
40      Steve        Murray  United Kingdom          54
41       Mark        Taylor       Australia          55
42      Diego     Gutiérrez       Argentina          56
43       Luis         Rojas           Chile          57
44      Manoj        Pareek           India          58
45       Puja    Srivastava           India          59

In [60]:
query = '''
SELECT e.FirstName,e.LastName,e.Title,e.City,e.State,e.Country,e.Email
FROM employees as e
WHERE e.Title  = "Sales Support Agent" 
'''

df = sql_query(query)
df

,FirstName,LastName,Title,City,State,Country,Email
0,Jane,Peacock,Sales Support Agent,Calgary,AB,Canada,jane@chinookcorp.com
1,Margaret,Park,Sales Support Agent,Calgary,AB,Canada,margaret@chinookcorp.com
2,Steve,Johnson,Sales Support Agent,Calgary,AB,Canada,steve@chinookcorp.com

In [61]:
query = '''
SELECT DISTINCT BillingCountry
FROM invoices
'''

df = sql_query(query)
df

    BillingCountry
0          Germany
1           Norway
2          Belgium
3           Canada
4              USA
5           France
6          Ireland
7   United Kingdom
8        Australia
9            Chile
10           India
11          Brazil
12        Portugal
13     Netherlands
14           Spain
15          Sweden
16  Czech Republic
17         Finland
18         Denmark
19           Italy
20          Poland
21         Austria
22         Hungary
23       Argentina

In [62]:
query = '''
SELECT DISTINCT State, COUNT (customers.CustomerId) as TOT
FROM customers
WHERE Country = "USA"
GROUP BY State 
ORDER BY TOT DESC
'''

df = sql_query(query)
df

   State  TOT
0     CA    3
1     WI    1
2     WA    1
3     UT    1
4     TX    1
5     NY    1
6     NV    1
7     MA    1
8     IL    1
9     FL    1
10    AZ    1

In [63]:
query = '''
SELECT i.invoiceId,COUNT (it.Quantity) as Cantidad_Total FROM invoice_items as it
INNER JOIN invoices as i
ON it.InvoiceId = i.InvoiceId
WHERE i.InvoiceId = 37
'''

df = sql_query(query)
df

   InvoiceId  Cantidad_Total
0         37               4

In [103]:
query = '''
SELECT InvoiceId, SUM(Quantity) AS Cantidad_Total
FROM invoice_items
GROUP BY InvoiceId;
'''

df = sql_query(query)
df

     InvoiceId  Cantidad_Total
0            1               2
1            2               4
2            3               6
3            4               9
4            5              14
..         ...             ...
407        408               4
408        409               6
409        410               9
410        411              14
411        412               1

[412 rows x 2 columns]

In [102]:
query = '''
SELECT COUNT(DISTINCT InvoiceId) AS Total_Facturas
FROM invoice_items;
'''

df = sql_query(query)
df

   Total_Facturas
0             412

In [83]:
query = '''
SELECT i.BillingCountry, COUNT (i.InvoiceId) FROM invoices as i
GROUP BY i.BillingCountry
'''

df = sql_query(query)
df

    BillingCountry  COUNT (i.InvoiceId)
0        Argentina                    7
1        Australia                    7
2          Austria                    7
3          Belgium                    7
4           Brazil                   35
5           Canada                   56
6            Chile                    7
7   Czech Republic                   14
8          Denmark                    7
9          Finland                    7
10          France                   35
11         Germany                   28
12         Hungary                    7
13           India                   13
14         Ireland                    7
15           Italy                    7
16     Netherlands                    7
17          Norway                    7
18          Poland                    7
19        Portugal                   14
20           Spain                    7
21          Sweden                    7
22             USA                   91
23  United Kingdom                   21

In [129]:
query = '''
SELECT strftime("%Y",InvoiceDate) AS Año,COUNT (InvoiceId) as TOT
FROM invoices
WHERE Año = "2009" or Año = "2011"
GROUP BY Año
'''

df = sql_query(query)
df

    Año  TOT
0  2009   83
1  2011   83

In [131]:
query = '''
SELECT strftime("%Y",InvoiceDate) AS Año,COUNT (InvoiceId) as TOT
FROM invoices
WHERE strftime("%Y", InvoiceDate) BETWEEN "2009" AND "2011"
GROUP BY Año
'''

df = sql_query(query)
df

    Año  TOT
0  2009   83
1  2010   83
2  2011   83

In [138]:
query = '''
SELECT c.Country,COUNT (c.CustomerId) as Clientes FROM customers as c
WHERE c.Country = "Spain" or c.Country = "Brazil"
GROUP BY c.Country
'''

df = sql_query(query)
df

  Country  Clientes
0  Brazil         5
1   Spain         1

In [143]:
query = '''
SELECT * 
FROM tracks
WHERE Name LIKE 'You%'
'''

sql_query(query)

,TrackId,Name,AlbumId,MediaTypeId,GenreId,Composer,Milliseconds,Bytes,UnitPrice
0,39,You Oughta Know,6,1,1,Alanis Morissette & Glenn Ballard,249234,8196916,0.99
1,44,You Learn,6,1,1,Alanis Morissette & Glenn Ballard,239699,7824837,0.99
2,50,You Oughta Know (Alternate),6,1,1,Alanis Morissette & Glenn Ballard,491885,16008629,0.99
3,99,Your Time Has Come,11,1,4,"Cornell, Commerford, Morello, Wilk",255529,8273592,0.99
4,337,You Shook Me,30,1,1,J B Lenoir/Willie Dixon,315951,10249958,0.99
5,349,You Shook Me(2),30,1,1,J B Lenoir/Willie Dixon,619467,20138673,0.99
6,549,You Fool No One,43,1,1,Coverdale/Lord/Paice,804101,26369966,0.99
7,623,You Fool No One (Alternate Version),50,1,1,Blackmore/Coverdale/Lord/Paice,763924,24887209,0.99
8,753,You Keep On Moving,58,1,1,Coverdale/Hughes,319111,10447868,0.99
9,812,You Can't Do it Right (With the One You Love),65,1,1,D.Coverdale/G.Hughes/Glenn Hughes/R.Blackmore/...,203755,6709579,0.99
10,1155,You're Crazy,90,2,1,None,197135,3301971,0.99
11,1163,You Ain't the First,91,2,1,None,156268,2754414,0.99
12,1185,You Could Be Mine,92,1,3,Izzy Stradlin'/W. Axl Rose,343875,11207355,0.99
13,1553,You've Got Another Thing Comin',125,1,3,None,305162,9962558,0.99
14,1620,You Shook Me,132,1,1,J. B. Lenoir/Willie Dixon,388179,12643067,0.99
15,1622,Your Time Is Gonna Come,132,1,1,Jimmy Page/John Paul Jones,274860,9011653,0.99
16,1776,You've Been A Long Time Coming,146,1,14,Brian Holland/Eddie Holland/Lamont Dozier,137221,4437949,0.99
17,1778,You're What's Happening (In The World Today),146,1,14,Allen Story/George Gordy/Robert Gordy,142027,4631104,0.99
18,1787,You Sure Love To Ball,146,1,14,Marvin Gaye,218540,7217872,0.99
19,2127,Your Blue Room,176,1,10,"Brian Eno, Bono, Adam Clayton, The Edge & Larr...",328228,10867860,0.99
20,2185,You Are,180,1,1,Matt Cameron,270863,8938409,0.99
21,2259,You're My Best Friend,185,1,1,"Deacon, John",172225,5602173,0.99
22,2287,You Are The Everything,188,1,4,Bill Berry-Peter Buck-Mike Mills-Michael Stipe,226298,7373181,0.99
23,2439,You've Got It,141,1,1,Mick Hucknall and Lamont Dozier,235232,7712845,0.99
24,2444,Your Mirror,141,1,1,Mick Hucknall,240666,7893821,0.99
25,2677,You Got Me Rocking,217,1,1,Jagger/Richards,205766,6734385,0.99
26,2691,You Got Me Rocking,218,1,1,Jagger/Richards,215928,7162159,0.99
27,2750,You Better You Bet,221,1,1,Pete Townshend,338520,11160877,0.99
28,3083,You Really Got Me,244,1,1,Ray Davies,158589,5194092,0.99
29,3113,You Got No Right,246,1,1,"Dave Kushner, Duff, Matt Sorum, Scott Weiland ...",335412,10991094,0.99
30,3141,You're Gonna Break My Hart Again,141,1,3,Sykes,250853,8176847,0.99
31,3225,Your Time Is Gonna Come,252,2,1,"Page, Jones",310774,5126563,0.99
32,3372,Your Savior,269,2,23,None,244226,4199626,0.99
33,3384,Your Soul Today,270,2,23,Chris Cornell,205959,3385722,0.99
34,3388,You Know My Name,270,2,23,Chris Cornell,240255,3940651,0.99
35,3456,You Know I'm No Good,321,2,14,None,256946,4133694,0.99
36,3465,You Know I'm No Good (feat. Ghostface Killah),321,2,14,None,202320,3260658,0.99
37,3468,You Sent Me Flying / Cherry,322,2,9,None,409906,6657517,0.99

In [ ]:
# Segunda parte

In [ ]:
# Ejercicio 1

In [144]:
query = '''
SELECT i.BillingCountry, c.FirstName, c.LastName, i.InvoiceId, i.InvoiceDate
FROM invoices as i
INNER JOIN customers as c
ON i.CustomerId = c.CustomerId
WHERE i.BillingCountry = "Brazil"
'''

sql_query(query)

   BillingCountry  FirstName   LastName  InvoiceId          InvoiceDate
0          Brazil    Eduardo    Martins         25  2009-04-09 00:00:00
1          Brazil    Roberto    Almeida         34  2009-05-23 00:00:00
2          Brazil   Fernanda      Ramos         35  2009-06-05 00:00:00
3          Brazil  Alexandre      Rocha         57  2009-09-06 00:00:00
4          Brazil   Fernanda      Ramos         58  2009-09-07 00:00:00
5          Brazil  Alexandre      Rocha         68  2009-10-17 00:00:00
6          Brazil   Fernanda      Ramos         80  2009-12-10 00:00:00
7          Brazil       Luís  Gonçalves         98  2010-03-11 00:00:00
8          Brazil       Luís  Gonçalves        121  2010-06-13 00:00:00
9          Brazil  Alexandre      Rocha        123  2010-06-17 00:00:00
10         Brazil   Fernanda      Ramos        132  2010-07-31 00:00:00
11         Brazil       Luís  Gonçalves        143  2010-09-15 00:00:00
12         Brazil    Eduardo    Martins        154  2010-11-14 00:00:00
13         Brazil    Roberto    Almeida        155  2010-11-14 00:00:00
14         Brazil    Roberto    Almeida        166  2010-12-25 00:00:00
15         Brazil    Eduardo    Martins        177  2011-02-16 00:00:00
16         Brazil       Luís  Gonçalves        195  2011-05-06 00:00:00
17         Brazil    Eduardo    Martins        199  2011-05-21 00:00:00
18         Brazil    Roberto    Almeida        221  2011-08-25 00:00:00
19         Brazil    Eduardo    Martins        251  2012-01-09 00:00:00
20         Brazil  Alexandre      Rocha        252  2012-01-22 00:00:00
21         Brazil   Fernanda      Ramos        253  2012-01-22 00:00:00
22         Brazil   Fernanda      Ramos        264  2012-03-03 00:00:00
23         Brazil  Alexandre      Rocha        275  2012-04-25 00:00:00
24         Brazil  Alexandre      Rocha        297  2012-07-28 00:00:00
25         Brazil       Luís  Gonçalves        316  2012-10-27 00:00:00
26         Brazil   Fernanda      Ramos        319  2012-11-01 00:00:00
27         Brazil       Luís  Gonçalves        327  2012-12-07 00:00:00
28         Brazil  Alexandre      Rocha        349  2013-03-18 00:00:00
29         Brazil    Roberto    Almeida        350  2013-03-31 00:00:00
30         Brazil    Eduardo    Martins        372  2013-07-02 00:00:00
31         Brazil    Roberto    Almeida        373  2013-07-03 00:00:00
32         Brazil       Luís  Gonçalves        382  2013-08-07 00:00:00
33         Brazil    Eduardo    Martins        383  2013-08-12 00:00:00
34         Brazil    Roberto    Almeida        395  2013-10-05 00:00:00

In [ ]:
# Ejercicio 2

In [ ]:
query = '''
SELECT e.FirstName,e.LastName,i.InvoiceId
FROM employees as e
INNER JOIN customers as c
ON e.EmployeeId = c.SupportRepId
INNER JOIN invoices as i
ON c.CustomerId = i.CustomerId
'''

df = sql_query(query)
df

    FirstName LastName  InvoiceId
0        Jane  Peacock         98
1        Jane  Peacock        121
2        Jane  Peacock        143
3        Jane  Peacock        195
4        Jane  Peacock        316
..        ...      ...        ...
407     Steve  Johnson         88
408     Steve  Johnson        217
409     Steve  Johnson        240
410     Steve  Johnson        262
411     Steve  Johnson        314

[412 rows x 3 columns]

In [ ]:
# Ejercicio 3

In [152]:
query = '''
SELECT c.FirstName,c.LastName,c.Country,e.FirstName,e.LastName
FROM employees as e
INNER JOIN customers as c
ON e.EmployeeId = c.SupportRepId
'''

df = sql_query(query)
df

    FirstName      LastName         Country FirstName LastName
0        Luís     Gonçalves          Brazil      Jane  Peacock
1      Leonie        Köhler         Germany     Steve  Johnson
2    François      Tremblay          Canada      Jane  Peacock
3       Bjørn        Hansen          Norway  Margaret     Park
4   František   Wichterlová  Czech Republic  Margaret     Park
5      Helena          Holý  Czech Republic     Steve  Johnson
6      Astrid        Gruber         Austria     Steve  Johnson
7        Daan       Peeters         Belgium  Margaret     Park
8        Kara       Nielsen         Denmark  Margaret     Park
9     Eduardo       Martins          Brazil  Margaret     Park
10  Alexandre         Rocha          Brazil     Steve  Johnson
11    Roberto       Almeida          Brazil      Jane  Peacock
12   Fernanda         Ramos          Brazil  Margaret     Park
13       Mark       Philips          Canada     Steve  Johnson
14   Jennifer      Peterson          Canada      Jane  Peacock
15      Frank        Harris             USA  Margaret     Park
16       Jack         Smith             USA     Steve  Johnson
17   Michelle        Brooks             USA      Jane  Peacock
18        Tim         Goyer             USA      Jane  Peacock
19        Dan        Miller             USA  Margaret     Park
20      Kathy         Chase             USA     Steve  Johnson
21    Heather       Leacock             USA  Margaret     Park
22       John        Gordon             USA  Margaret     Park
23      Frank       Ralston             USA      Jane  Peacock
24     Victor       Stevens             USA     Steve  Johnson
25    Richard    Cunningham             USA  Margaret     Park
26    Patrick          Gray             USA  Margaret     Park
27      Julia       Barnett             USA     Steve  Johnson
28     Robert         Brown          Canada      Jane  Peacock
29     Edward       Francis          Canada      Jane  Peacock
30     Martha          Silk          Canada     Steve  Johnson
31      Aaron      Mitchell          Canada  Margaret     Park
32      Ellie      Sullivan          Canada      Jane  Peacock
33       João     Fernandes        Portugal  Margaret     Park
34   Madalena       Sampaio        Portugal  Margaret     Park
35     Hannah     Schneider         Germany     Steve  Johnson
36       Fynn    Zimmermann         Germany      Jane  Peacock
37     Niklas      Schröder         Germany      Jane  Peacock
38    Camille       Bernard          France  Margaret     Park
39  Dominique      Lefebvre          France  Margaret     Park
40       Marc        Dubois          France     Steve  Johnson
41      Wyatt        Girard          France      Jane  Peacock
42   Isabelle       Mercier          France      Jane  Peacock
43      Terhi    Hämäläinen         Finland      Jane  Peacock
44   Ladislav        Kovács         Hungary      Jane  Peacock
45       Hugh      O'Reilly         Ireland      Jane  Peacock
46      Lucas       Mancini           Italy     Steve  Johnson
47   Johannes  Van der Berg     Netherlands     Steve  Johnson
48  Stanisław        Wójcik          Poland  Margaret     Park
49    Enrique         Muñoz           Spain     Steve  Johnson
50     Joakim     Johansson          Sweden     Steve  Johnson
51       Emma         Jones  United Kingdom      Jane  Peacock
52       Phil        Hughes  United Kingdom      Jane  Peacock
53      Steve        Murray  United Kingdom     Steve  Johnson
54       Mark        Taylor       Australia  Margaret     Park
55      Diego     Gutiérrez       Argentina  Margaret     Park
56       Luis         Rojas           Chile     Steve  Johnson
57      Manoj        Pareek           India      Jane  Peacock
58       Puja    Srivastava           India      Jane  Peacock

In [ ]:
#Ejercicio 4

In [153]:
query = '''
SELECT it.InvoiceLineId,t.Name
FROM invoice_items as it
INNER JOIN tracks as t
ON it.TrackId = t.TrackId
'''

df = sql_query(query)
df

      InvoiceLineId                                               Name
0               579            For Those About To Rock (We Salute You)
1                 1                                  Balls to the Wall
2              1154                                  Balls to the Wall
3              1728                                    Fast As a Shark
4                 2                                  Restless and Wild
...             ...                                                ...
2235           1726  Symphony No. 2, Op. 16 -  "The Four Temperamen...
2236            577    Étude 1, In C Major - Preludio (Presto) - Liszt
2237           1153  Pini Di Roma (Pinien Von Rom) \ I Pini Della V...
2238            578  String Quartet No. 12 in C Minor, D. 703 "Quar...
2239           1727  String Quartet No. 12 in C Minor, D. 703 "Quar...

[2240 rows x 2 columns]

In [ ]:
#Ejercicio 5

In [154]:
query = '''
SELECT t.Name,m.Name,al.Title,gen.Name
FROM tracks as t
INNER JOIN media_types as m
ON t.MediaTypeId = m.MediaTypeId
INNER JOIN albums as al
ON t.AlbumId = al.AlbumId
INNER JOIN genres as gen
ON t.GenreId = gen.GenreId
'''

df = sql_query(query)
df

,Name,Name,Title,Name
0,For Those About To Rock (We Salute You),MPEG audio file,For Those About To Rock We Salute You,Rock
1,Balls to the Wall,Protected AAC audio file,Balls to the Wall,Rock
2,Fast As a Shark,Protected AAC audio file,Restless and Wild,Rock
3,Restless and Wild,Protected AAC audio file,Restless and Wild,Rock
4,Princess of the Dawn,Protected AAC audio file,Restless and Wild,Rock
...,...,...,...,...
3498,Pini Di Roma (Pinien Von Rom) \ I Pini Della V...,Protected AAC audio file,Respighi:Pines of Rome,Classical
3499,"String Quartet No. 12 in C Minor, D. 703 ""Quar...",Protected AAC audio file,Schubert: The Late String Quartets & String Qu...,Classical
3500,"L'orfeo, Act 3, Sinfonia (Orchestra)",Protected AAC audio file,Monteverdi: L'Orfeo,Classical
3501,"Quintet for Horn, Violin, 2 Violas, and Cello ...",Protected AAC audio file,Mozart: Chamber Music,Classical
3502,"Die Zauberflöte, K.620: ""Der Hölle Rache Kocht...",Protected AAC audio file,Mozart Gala: Famous Arias,Opera

In [ ]:
#Ejercicio 6

In [157]:
query = '''
SELECT pl.Name,COUNT (t.Name) AS Canciones_totales
FROM tracks as t
INNER JOIN playlist_track as pt
ON t.TrackId = pt.TrackId
INNER JOIN playlists as pl
ON pt.PlaylistId = pl.PlaylistId
GROUP BY pl.Name
'''

df = sql_query(query)
df

                          Name  Canciones_totales
0                   90’s Music               1477
1              Brazilian Music                 39
2                    Classical                 75
3    Classical 101 - Deep Cuts                 25
4   Classical 101 - Next Steps                 25
5   Classical 101 - The Basics                 25
6                       Grunge                 15
7          Heavy Metal Classic                 26
8                        Music               6580
9                 Music Videos                  1
10                 On-The-Go 1                  1
11                    TV Shows                426